Catalogs/ЗадачиПроектов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.10">
	<Catalog>
		<Properties>
			<Name>ЗадачиПроектов</Name>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Hierarchical>true</Hierarchical>
			<Owners>
				<xr:Item>Catalog.СделкиСКлиентами</xr:Item>
				<xr:Item>Catalog.Проекты</xr:Item>
				<xr:Item>Catalog.МаркетинговыеМероприятия</xr:Item>
				<xr:Item>Catalog.ПретензииКлиентов</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ГИГ_ПредметРасчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.гиг_ПредметыРасчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Куратор</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОписаниеЗадачи</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Исполнитель</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроцентВыполнения</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Закрыта</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Стадия</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:EnumRef.СтадииЗадач</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПлановаяДатаНачала</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПлановаяПродолжительность</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОписаниеРезультата</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>гиг_ЗначенияПараметров</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>НаименованиеВариантаПараметров</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторВариантаПараметров</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПараметрПредметаРасчета</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.гиг_ПараметрыПредметовРасчета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеПараметра</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.гиг_ЗначенияПараметровПредметовРасчета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/гиг_ПредметыРасчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.10">
	<Catalog>
		<Properties>
			<Name>гиг_ПредметыРасчета</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ИндексЭлемента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>11</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Куратор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Исполнитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>НаборПараметров</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Параметр</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.гиг_ПараметрыПредметовРасчета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Трудозатраты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидРабот</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыРаботСотрудников</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЭтапПроизводства</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЭтапПроизводстваПредставление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НаименованиеЭтапаПроизводства</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ЭтапыПроизводства</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>НомерЭтапа</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>4</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерСледующегоЭтапа</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>4</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Наименование</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Подразделение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДлительностьЭтапа</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмеренияДлительностиЭтапа</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ЕдиницыИзмеренияВремени</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>МаршрутнаяКарта</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.МаршрутныеКарты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ГруппыНоменклатуры</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Группа</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/ЗадачиПроектов/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаКлиенте
Процедура ГИГ_ПредметРасчетаПриИзмененииПосле(Элемент)
	//++Шерстюк Ю.Ю. 27.01.21
	Если ЗначениеЗаполнено(Объект.Куратор) или ЗначениеЗаполнено(Объект.Исполнитель) Тогда
		Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопроса",ЭтотОбъект);	
 		ПоказатьВопрос(Оповещение,"Заполнить Куратора и Исполнителя из предмета расчета?",РежимДиалогаВопрос.ДаНет,0,КодВозвратаДиалога.Да); 
	Иначе 
		 ПослеЗакрытияВопроса(КодВозвратаДиалога.Да,0);
	КонецЕсли;
	//--Шерстюк Ю.Ю.
	ОбновитьТаблицуВариантовПараметровНаСервере();
КонецПроцедуры

//++Шерстюк Ю.Ю. 27.01.21
&НаКлиенте
Процедура ПослеЗакрытияВопроса(Результат, Параметры) Экспорт
 
	Если Результат = КодВозвратаДиалога.Да Тогда
		 Объект.Куратор = ОбщегоНазначенияУТВызовСервера.ЗначениеРеквизитаОбъекта(Объект.ГИГ_ПредметРасчета, "Куратор");
		 Объект.Исполнитель = ОбщегоНазначенияУТВызовСервера.ЗначениеРеквизитаОбъекта(Объект.ГИГ_ПредметРасчета, "Исполнитель");
    КонецЕсли;	
 
КонецПроцедуры

//--Шерстюк Ю.Ю.

&НаКлиенте
Процедура ГИГ_ОбработкаВыбораПосле(ВыбранноеЗначение, ИсточникВыбора)
	
	//гиг_РасчетИзделийКлиент.ОбработкаВыбора(ЭтаФорма, Объект.гиг_ЗначенияПараметров, ВыбранноеЗначение, ИсточникВыбора);
	
	ТекущаяСтрока = Элементы.ТаблицаВариантовПараметров.ТекущиеДанные;
	Если ТекущаяСтрока <> Неопределено Тогда
		Если ТекущийЭлемент.Имя = "ТаблицаВариантовПараметров" Тогда
			ТекущаяСтрока[ТекущийЭлемент.ТекущийЭлемент.Имя] = ВыбранноеЗначение;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ГИГ_ПередЗаписьюПосле(Отказ, ПараметрыЗаписи)
	
	Если Модифицированность Тогда
		ГИГ_ПередЗаписьюПослеНаСервере();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ГИГ_ПередЗаписьюПослеНаСервере()
	
	Объект.гиг_ЗначенияПараметров.Очистить();
	Для Каждого ТекСтрока Из ТаблицаВариантовПараметров Цикл
		Для Каждого ТекПараметр Из СписокПараметров Цикл
			НоваяСтрока = Объект.гиг_ЗначенияПараметров.Добавить();
			НоваяСтрока.НаименованиеВариантаПараметров = ТекСтрока.Наименование;
			НоваяСтрока.ИдентификаторВариантаПараметров = ТекСтрока.Идентификатор;
			НоваяСтрока.ПараметрПредметаРасчета = ТекПараметр.Параметр;
			НоваяСтрока.ЗначениеПараметра = ТекСтрока[ТекПараметр.НаименованиеПараметра];
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ГИГ_ПереформироватьНаименованияПосле(Команда)
	ГИГ_ПереформироватьНаименованияПослеНаСервере();
КонецПроцедуры

&НаСервере
Процедура ГИГ_ПереформироватьНаименованияПослеНаСервере()
	
	Изменение = Ложь;
	МассивСтрок = Элементы.ТаблицаВариантовПараметров.ВыделенныеСтроки;    
    Для каждого Идентификатор Из МассивСтрок Цикл
		ТекСтрока = ТаблицаВариантовПараметров[Идентификатор];
		ТекСтрока.Наименование = Строка(Объект.ГИГ_ПредметРасчета);
		Для Каждого СтрокаПараметра Из СписокПараметров Цикл
			ИмяПараметра = СтрЗаменить(Строка(СтрокаПараметра.Параметр), " ", "");
			ТекСтрока.Наименование = ТекСтрока.Наименование + " / " + Строка(СтрокаПараметра.Параметр) + " - " + ТекСтрока[ИмяПараметра];
		КонецЦикла;
		Изменение = Истина;
    КонецЦикла;
	
	//Для Каждого ТекСтрока Из ТаблицаВариантовПараметров Цикл
	//	ТекСтрока.Наименование = Строка(Объект.ГИГ_ПредметРасчета);
	//	Для Каждого СтрокаПараметра Из СписокПараметров Цикл
	//		ИмяПараметра = СтрЗаменить(Строка(СтрокаПараметра.Параметр), " ", "");
	//		ТекСтрока.Наименование = ТекСтрока.Наименование + " / " + Строка(СтрокаПараметра.Параметр) + " - " + ТекСтрока[ИмяПараметра];
	//	КонецЦикла;
	//	Изменение = Истина;
	//КонецЦикла;
	
	Модифицированность = Изменение;
	
КонецПроцедуры

&НаСервере
Процедура ГИГ_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
	Если ТипЗнч(Объект.Владелец) = Тип("СправочникСсылка.Проекты")
	   И ЗначениеЗаполнено(Объект.Владелец)
	   И ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.Владелец, "гиг_РасчетИзделий")
	Тогда
		Элементы.ГруппаПараметрыРасчета.Видимость = Истина;
		//ОбновитьДеревоЗначенийНаСервере();
		ОбновитьТаблицуВариантовПараметровНаСервере();
		ЗагрузитьДанныеТаблицыВариантовПараметровНаСервере();
	Иначе
		Элементы.ГруппаПараметрыРасчета.Видимость = Ложь;
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Процедура ГИГ_ПрограммноеДобавлениеЭлементовНаСервере()
	
	ЭтаФорма.УстановитьДействие("ОбработкаВыбора", "ГИГ_ОбработкаВыбораПосле");
	ЭтаФорма.УстановитьДействие("ПередЗаписью", "ГИГ_ПередЗаписьюПосле");

КонецПроцедуры

&НаКлиенте
Процедура ГИГ_ТаблицаВариантовПараметровПараметрНачалоВыбораПосле(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Если Элементы.ТаблицаВариантовПараметров.ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ПредметРасчета", Объект.ГИГ_ПредметРасчета);
	
	ПараметрыПоиска = Новый Структура;
	ПараметрыПоиска.Вставить("НаименованиеПараметра", Элемент.Имя);
	МассивПараметров = СписокПараметров.НайтиСтроки(ПараметрыПоиска);
	Если МассивПараметров.Количество() > 0 Тогда
		ПараметрыФормы.Вставить("ПараметрРасчета", МассивПараметров[0].Параметр);
	КонецЕсли;
	
	ДанныеВыбора = ОткрытьФорму("Справочник.гиг_ЗначенияПараметровПредметовРасчета.ФормаВыбора", 
			ПараметрыФормы, 
			ЭтаФорма, 
			ЭтаФорма.УникальныйИдентификатор,,,, 
			РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры
		
&НаКлиенте
Процедура ГИГ_ТаблицаВариантовПараметровПередНачаломДобавленияПосле(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Если Не ЗначениеЗаполнено(Объект.ГИГ_ПредметРасчета) Тогда
		Отказ = Истина;
		ПоказатьПредупреждение(, "Выберите предмет расчета!");
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ГИГ_ТаблицаВариантовПараметровПередОкончаниемРедактированияПосле(Элемент, НоваяСтрока, ОтменаРедактирования, Отказ)
	//Если НоваяСтрока Тогда
		ТекущаяСтрока = Элементы.ТаблицаВариантовПараметров.ТекущиеДанные;
		ТекущаяСтрока.Идентификатор = Строка(Новый УникальныйИдентификатор());
		//Если Не ЗначениеЗаполнено(ТекущаяСтрока.Наименование) Тогда
			ТекущаяСтрока.Наименование = Строка(Объект.ГИГ_ПредметРасчета);
			Для Каждого СтрокаПараметра Из СписокПараметров Цикл
				ИмяПараметра = СтрЗаменить(Строка(СтрокаПараметра.Параметр), " ", "");
				ТекущаяСтрока.Наименование = ТекущаяСтрока.Наименование + " / " + Строка(СтрокаПараметра.Параметр) + " - " + ТекущаяСтрока[ИмяПараметра];
			КонецЦикла;
		//КонецЕсли;
	//КонецЕсли;
	Если Не ОтменаРедактирования Тогда
		Модифицированность = Истина;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ГИГ_ТаблицаВариантовПараметровПослеУдаленияПосле(Элемент)
	Модифицированность = Истина;
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьДанныеТаблицыВариантовПараметровНаСервере()
	
	ТаблицаВариантовПараметров.Очистить();
	Для Каждого СтрокаТаблицы Из Объект.гиг_ЗначенияПараметров Цикл
		ПараметрыОтбора = Новый Структура;
		ПараметрыОтбора.Вставить("Идентификатор", СтрокаТаблицы.ИдентификаторВариантаПараметров);
		МассивСтрок = ТаблицаВариантовПараметров.НайтиСтроки(ПараметрыОтбора);
		Если МассивСтрок.Количество() > 0 Тогда
			НоваяСтрока = МассивСтрок[0];
		Иначе
			НоваяСтрока = ТаблицаВариантовПараметров.Добавить();
			НоваяСтрока.Наименование = СтрокаТаблицы.НаименованиеВариантаПараметров;
			НоваяСтрока.Идентификатор = СтрокаТаблицы.ИдентификаторВариантаПараметров;
		КонецЕсли;
		Если ЗначениеЗаполнено(СтрокаТаблицы.ПараметрПредметаРасчета) Тогда
			НоваяСтрока[СтрЗаменить(СтрокаТаблицы.ПараметрПредметаРасчета.Наименование, " ", "")] = СтрокаТаблицы.ЗначениеПараметра;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьДеревоЗначенийНаСервере()
	
	гиг_РасчетИзделий.ОбновитьДеревоЗначений(Объект.гиг_ЗначенияПараметров, ЭтаФорма);
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьТаблицуВариантовПараметровНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	гиг_ПредметыРасчетаНаборПараметров.Параметр КАК Параметр,
	|	гиг_ПредметыРасчетаНаборПараметров.Параметр.Наименование КАК Наименование
	|ИЗ
	|	Справочник.гиг_ПредметыРасчета.НаборПараметров КАК гиг_ПредметыРасчетаНаборПараметров
	|ГДЕ
	|	гиг_ПредметыРасчетаНаборПараметров.Ссылка = &ПредметРасчета";
	
	Запрос.УстановитьПараметр("ПредметРасчета", Объект.ГИГ_ПредметРасчета);
	Выборка = Запрос.Выполнить().Выбрать();
	
	УдаляемыеРеквизиты = Новый Массив;
	Для Каждого ЭлементПараметра Из СписокПараметров Цикл
		УдаляемыеРеквизиты.Добавить("ТаблицаВариантовПараметров." + ЭлементПараметра.НаименованиеПараметра);
	КонецЦикла;
	
	СписокПараметров.Очистить();
	// Массив для новых реквизитов
	ДобавляемыеРеквизиты = Новый Массив;
	
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = СписокПараметров.Добавить();
		НоваяСтрока.Параметр = Выборка.Параметр;
		ИмяПараметра = СтрЗаменить(Выборка.Наименование, " ", "");
		НоваяСтрока.НаименованиеПараметра = ИмяПараметра;
		
		//Если Элементы.Найти(ИмяПараметра) <> Неопределено Тогда
		//	//УдаляемыеРеквизиты.Добавить(
		//	Продолжить;
		//КонецЕсли;
		// Опишем ревизиты формы
		//Реквизит_Параметр = Новый РеквизитФормы("Параметр_"+ИмяПараметра,	Новый ОписаниеТипов("СправочникСсылка.гиг_ПараметрыПредметовРасчета"),	"ТаблицаВариантовПараметров", "Параметр " + Выборка.Наименование);
		Реквизит_ЗначениеПараметра = Новый РеквизитФормы(ИмяПараметра,	Новый ОписаниеТипов("СправочникСсылка.гиг_ЗначенияПараметровПредметовРасчета"),	"ТаблицаВариантовПараметров", Выборка.Наименование);
		
		// Для наглядности заполним массив после описания реквизитов формы
		//ДобавляемыеРеквизиты.Добавить(Реквизит_Параметр);
		ДобавляемыеРеквизиты.Добавить(Реквизит_ЗначениеПараметра);		
	КонецЦикла;
	
	// Добавим новые реквизиты в форму
	Если ДобавляемыеРеквизиты.Количество() <> 0 Тогда
		ИзменитьРеквизиты(ДобавляемыеРеквизиты, УдаляемыеРеквизиты);
	КонецЕсли;
	
	Для Каждого РеквизитФормы Из ДобавляемыеРеквизиты Цикл
		Если Элементы.Найти(РеквизитФормы.Имя) <> Неопределено Тогда
			Продолжить;
		КонецЕсли;
		НовыйЭлемент = Элементы.Добавить(РеквизитФормы.Имя, Тип("ПолеФормы"), Элементы.ТаблицаВариантовПараметров);
		НовыйЭлемент.ПутьКДанным    = "ТаблицаВариантовПараметров."+РеквизитФормы.Имя;
		НовыйЭлемент.Вид            = ВидПоляФормы.ПолеВвода;
		НовыйЭлемент.УстановитьДействие("НачалоВыбора", "ГИГ_ТаблицаВариантовПараметровПараметрНачалоВыбораПосле");
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура ПодобратьЗначенияПараметров(Команда)
	
	гиг_РасчетИзделийКлиент.ПодобратьЗначенияПараметров(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ПодобратьПредметыРасчета(Команда)
	
	гиг_РасчетИзделийКлиент.ПодобратьПредметыРасчета(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьЗначение(Команда)
	
	гиг_РасчетИзделийКлиент.УдалитьЗначение(ЭтаФорма, Объект.гиг_ЗначенияПараметров);
	
КонецПроцедуры


&НаСервере
Процедура Рин1_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
	ГИГ_ПрограммноеДобавлениеЭлементовНаСервере();
	ГИГ_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка);
	
КонецПроцедуры

&НаСервере
&После("УстановитьУсловноеОформление")
Процедура Рин1_УстановитьУсловноеОформление()
	
	гиг_РасчетИзделий.УстановитьУсловноеОформление(Элементы, УсловноеОформление);
	
КонецПроцедуры
